TITLE_START_BTN="""
Для подтверждения записи на пробное занятие по битбоксу нажмите «Я пойду» 👇🏻 

После чего мы пришлем бесплатный чек-лист:
«Переводчик детского «не хочу»: 3 скрытых смысла, о которых молчат психологи.» 🎁 
"""
TEXT_START_BTN="Я пойду"
CHECK_LIST = """
Переводчик детского «не хочу»: 3 скрытых смысла, о которых молчат психологи.
"""
WRITE_TEST = "Отлично. Ждем Вас на уроке. А вот и Ваш подарок: 👇"
REMINDER_TEXT = """
напоминаем, что сегодня вечером у вас пробное занятие по битбоксу. Не забудьте добавить ребенка в группу, чтобы он успел познакомиться и группой и учителем. 

Хорошего урока 💥
"""

ADDED_TO_GROUP_PARENT_TEXT = """Родитель, добро пожаловать в группу!"""
ADDED_TO_GROUP_CHILD_TEXT = """Ребёнок, добро пожаловать в группу!"""
TEXT_START_FROM_GROUP = "перейти в бота"